situations = [
    {
        'id': 1,
        'description': 'К вам пришел знатный человек, который хочет купить землю у вас.',
        'option': 'Продать землю за хорошую цену.',
        'option_effect': {'money': 10000, 'popularity': -10, 'army': 0, 'land': -5},
    },
    {
    'id': 2,
    'description': 'Ваше королевство столкнулось с нападением врага.',
    'option': 'Начать войну.',
    'option_effect': {'money': -5000, 'popularity': -5, 'army': 1000, 'land': 0},
    },
{
    'id': 3,
    'description': 'В ваш город ворвались разбойники и начали грабить магазины и дома.',
    'option': 'Вызвать стражу.',
    'option_effect': {'money': -1000, 'popularity': 5, 'army': 100, 'land': 0},
},

{
    'id': 4,
    'description': 'Ваше королевство попало в засуху и люди начинают страдать от нехватки воды.',
    'option': 'Закупить воду у соседнего королевства.',
    'option_effect': {'money': -2000, 'popularity': 10, 'army': 0, 'land': 0},
},

{
    'id': 5,
    'description': 'Ваше королевство столкнулось с эпидемией.',
    'option': 'Выделить деньги на лечение и медикаменты.',
    'option_effect': {'money': -3000, 'popularity': 10, 'army': 0, 'land': 0},
},

{
    'id': 6,
    'description': 'На границе вашего королевства обнаружили опасный вирус, который может привести к массовой эпидемии.',
    'option': 'Запретить въезд людей из зараженных территорий.',
    'option_effect': {'money': 0, 'popularity': 5, 'army': 0, 'land': 0},
},
{
    'id': 7,
    'description': 'На территории вашего королевства обнаружены новые золотые рудники.',
    'option': 'Начать разработку рудников и продавать золото.',
    'option_effect': {'money': 10000, 'popularity': 5, 'army': 0, 'land': 10},
},

{
    'id': 8,
    'description': 'Ваше королевство столкнулось с нехваткой продовольствия.',
    'option': 'Закупить еду у соседнего королевства.',
    'option_effect': {'money': -5000, 'popularity': 10, 'army': 0, 'land': 0},
}


]
