situations = [
    {
        "id": 1,
        "description": "Ваше королевство столкнулось с наводнением.",
        "option": "Выделить деньги на восстановление инфраструктуры.",
        "option_effect": {
            "money": -8000,
            "popularity": 5,
            "army": 0,
            "land": 0
        }
    },

    {
        "id": 2,
        "description": "Ваш королевский советник был обвинен в коррупции.",
        "option": "Нанять нового советника.",
        "option_effect": {
            "money": -4000,
            "popularity": 10,
            "army": 0,
            "land": 0
        }
    },

    {
        "id": 3,
        "description": "Одна из соседних стран предлагает заключить договор о взаимном сотрудничестве.",
        "option": "Подписать договор и начать сотрудничать.",
        "option_effect": {
            "money": 5000,
            "popularity": 5,
            "army": 0,
            "land": 5
        }
    },

    {
        "id": 4,
        "description": "Началась крупная забастовка рабочих на заводе, который является важным источником дохода для королевства.",
        "option": "Удовлетворить требования рабочих.",
        "option_effect": {
            "money": -10000,
            "popularity": 10,
            "army": 0,
            "land": 0
        }
    },

    {
        "id": 5,
        "description": "На границе королевства появилась угроза вторжения вражеских войск.",
        "option": "Призвать в армию резервистов и укрепить границу.",
        "option_effect": {
            "money": -5000,
            "popularity": 5,
            "army": 500,
            "land": 0
        }
    },
    {
        "id": 6,
        "description": "Ваше королевство оказалось в центре землетрясения. Многие здания разрушены, люди нуждаются в помощи.",
        "option": "Начать восстановление города.",
        "option_effect": {"money": -8000, "popularity": 15, "army": 0, "land": 0}
    },
    {
        "id": 7,
        "description": "Вы узнали о тайной секте внутри вашего королевства, которая сеет раздор и мешает вам управлять.",
        "option": "Начать расследование и уничтожить секту.",
        "option_effect": {"money": -5000, "popularity": 10, "army": -100, "land": 0}
    },
    {
        "id": 8,
        "description": "На границе вашего королевства появился новый народ, который просит у вас убежища.",
        "option": "Разрешить этим людям въехать в ваше королевство и предоставить им землю.",
        "option_effect": {"money": -2000, "popularity": 5, "army": 0, "land": 5}
    }

]
